Show / Hide Table of Contents
Namespace IdeaRS.OpenModel.Parameters
Classes
AnchorParam
Parameter which represts the record of the anchor in IDEA MPRL
BoltParam
Parameter which represts the record of the bolt in IDEA MPRL
CrossSectionParam
Parameter which represts the record of the cross-section in IDEA MPRL
MaterialParam
Parameter which represts the record of the material in IDEA MPRL
MprlRecord
Parameter which represts the general record in IDEA MPRL
NumberGroups
Defines used input of groups of numbers.
ValueCount
Specifies pair of value and their count.
WeldParam
Parameter which represts the record of the weld in IDEA MPRL
Enums
AnchorType
Defines a type of anchor end.
BoltShearType
Defines a transfer of shear force in bolts.
ConnectorGridType
Defines a type of fasteners grid.
PolarInputType
Type of polar input
PositionRelatedTo
Position, to which is input related to.
WeldType
Represents the code of the position